<!-- add-pr-comment:pinpoint_to_sqs_sms_callbacks_plan -->

# production/pinpoint_to_sqs_sms_callbacks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_log_metric_filter.pinpoint_us_to_sqs_sms_callbacks-500-errors-api[0] will be created
  + resource "aws_cloudwatch_log_metric_filter" "pinpoint_us_to_sqs_sms_callbacks-500-errors-api" {
      + apply_on_transformed_logs = (known after apply)
      + id                        = (known after apply)
      + log_group_name            = "/aws/lambda/pinpoint_to_sqs_sms_callbacks_us_west_2"
      + name                      = "pinpoint_to_sqs_sms_callbacks-500-errors-api"
      + pattern                   = "\"\\\"levelname\\\": \\\"ERROR\\\"\""
      + region                    = "us-west-2"
      + metric_transformation {
          + name      = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }
  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_failures_us_west_2_to_lambda[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_failures_us_west_2_to_lambda" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = (sensitive value)
      + name            = "pinpoint_deliveries_failures_us_west_2"
      + region          = "us-west-2"
      + role_arn        = (known after apply)
        # (1 unchanged attribute hidden)
    }
  # aws_cloudwatch_log_subscription_filter.pinpoint_deliveries_us_west_2_to_lambda[0] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "pinpoint_deliveries_us_west_2_to_lambda" {
      + destination_arn = (known after apply)
      + distribution    = "ByLogStream"
      + id              = (known after apply)
      + log_group_name  = (sensitive value)
      + name            = "pinpoint_deliveries_us_west_2"
      + region          = "us-west-2"
      + role_arn        = (known after apply)
        # (1 unchanged attribute hidden)
    }
  # aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-critical-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda-image-pinpoint-delivery-receipts-errors-critical-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "20 errors on Lambda pinpoint-to-sqs-sms-callbacks in 10 minutes"
      + alarm_name                            = "lambda-image-pinpoint-delivery-receipts-errors-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "pinpoint_to_sqs_sms_callbacks_us_west_2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + null,
        ]
      + period                                = 600
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.lambda-image-pinpoint-delivery-receipts-errors-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda-image-pinpoint-delivery-receipts-errors-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "5 errors on Lambda pinpoint-to-sqs-sms-callbacks in 10 minutes"
      + alarm_name                            = "lambda-image-pinpoint-delivery-receipts-errors-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "pinpoint_to_sqs_sms_callbacks_us_west_2"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + null,
        ]
      + period                                = 600
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "One 500 error in 1 minute for pinpoint_to_sqs_sms_callbacks api"
      + alarm_name                            = "logs-1-500-error-1-minute-warning-pinpoint_to_sqs_sms_callbacks-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + null,
        ]
      + period                                = 60
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "Ten 500 errors in 5 minutes for pinpoint_to_sqs_sms_callbacks api"
      + alarm_name                            = "logs-10-500-error-5-minutes-critical-pinpoint_to_sqs_sms_callbacks-api"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "500-errors-pinpoint_to_sqs_sms_callbacks-api"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + null,
        ]
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-blocked-as-spam-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-blocked-as-spam-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "More than 10 Pinpoint SMS have been blocked as spam over 12 hours"
      + alarm_name                            = "pinpoint-sms-blocked-as-spam-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-blocked-as-spam"
      + namespace                             = "LogMetrics"
      + period                                = 43200
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-phone-carrier-unavailable-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-phone-carrier-unavailable-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "More than 100 Pinpoint SMS failed because a phone carrier is unavailable over 3 hours"
      + alarm_name                            = "pinpoint-sms-phone-carrier-unavailable-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-phone-carrier-unavailable"
      + namespace                             = "LogMetrics"
      + period                                = 10800
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-rate-exceeded-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-rate-exceeded-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "At least 1 Pinpoint SMS rate exceeded error in 5 minutes"
      + alarm_name                            = "pinpoint-sms-rate-exceeded-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pinpoint-sms-rate-exceeded"
      + namespace                             = "LogMetrics"
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-critical-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-critical-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "Pinpoint SMS success rate is below 25% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-critical"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + ok_actions                            = [
          + null,
        ]
      + region                                = "us-west-2"
      + tags_all                              = (known after apply)
      + threshold                             = 0.25
      + treat_missing_data                    = "notBreaching"
      + metric_query {
          + id          = "failures"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "pinpoint-sms-failures"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "successes"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "pinpoint-sms-successes"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "successes / (successes + failures)"
          + id          = "success_rate"
          + label       = "Success Rate"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_metric_alarm.pinpoint-sms-success-rate-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "pinpoint-sms-success-rate-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "Pinpoint SMS success rate is below 60% over 2 consecutive periods of 12 hours"
      + alarm_name                            = "pinpoint-sms-success-rate-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + datapoints_to_alarm                   = 2
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + region                                = "us-west-2"
      + tags_all                              = (known after apply)
      + threshold                             = 0.6
      + treat_missing_data                    = "notBreaching"
      + metric_query {
          + id          = "failures"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "pinpoint-sms-failures"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "successes"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "pinpoint-sms-successes"
              + namespace   = "LogMetrics"
              + period      = 43200
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "successes / (successes + failures)"
          + id          = "success_rate"
          + label       = "Success Rate"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_metric_alarm.total-sms-spending-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "total-sms-spending-critical" {
      ~ alarm_actions                         = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
        id                                    = "total-sms-spending-critical"
        tags                                  = {}
        # (22 unchanged attributes hidden)
        # (3 unchanged blocks hidden)
    }
  # aws_cloudwatch_metric_alarm.total-sms-spending-critical-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "total-sms-spending-critical-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "SMS spending reached 90% of limit this month"
      + alarm_name                            = "total-sms-spending-critical-us-west-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + region                                = "us-west-2"
      + tags_all                              = (known after apply)
      + threshold                             = 1800
      + treat_missing_data                    = "notBreaching"
      + metric_query {
          + id          = "pinpoint_spend"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "TextMessageMonthlySpend"
              + namespace   = "AWS/SMSVoice"
              + period      = 300
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "sns_spend"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "SMSMonthToDateSpentUSD"
              + namespace   = "AWS/SNS"
              + period      = 300
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "sns_spend + pinpoint_spend"
          + id          = "total_spend"
          + label       = "Total SMS Monthly Spend"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_metric_alarm.total-sms-spending-warning-us-west-2[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "total-sms-spending-warning-us-west-2" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + null,
        ]
      + alarm_description                     = "SMS spending reached 80% of limit this month"
      + alarm_name                            = "total-sms-spending-warning-us-west-2"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + region                                = "us-west-2"
      + tags_all                              = (known after apply)
      + threshold                             = 1600
      + treat_missing_data                    = "notBreaching"
      + metric_query {
          + id          = "pinpoint_spend"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "TextMessageMonthlySpend"
              + namespace   = "AWS/SMSVoice"
              + period      = 300
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "sns_spend"
          + return_data = false
            # (3 unchanged attributes hidden)
          + metric {
              + metric_name = "SMSMonthToDateSpentUSD"
              + namespace   = "AWS/SNS"
              + period      = 300
              + stat        = "Maximum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "sns_spend + pinpoint_spend"
          + id          = "total_spend"
          + label       = "Total SMS Monthly Spend"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }
  # aws_cloudwatch_query_definition.pinpoint-sms-blocked-as-spam[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "pinpoint-sms-blocked-as-spam" {
        id                  = "1256e278-9ce0-4964-a8f0-4cb465a5d047"
        name                = "SMS (Pinpoint) / Block as spam"
      ~ query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | filter eventType = 'TEXT_SPAM'
            | sort Timestamp desc
            | limit 100
          - }
        EOT
        # (3 unchanged attributes hidden)
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-blocked-as-spam[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-blocked-as-spam" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Block as spam"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | filter eventType = 'TEXT_SPAM'
            | sort Timestamp desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-carrier-dwell-times[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-carrier-dwell-times" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Carrier dwell times"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            stats avg((eventTimestamp - messageRequestTimestamp) / 1000 / 60) as Avg_carrier_time_minutes,
            count(*) as Number by carrierName as Carrier
            | filter isFinal
            | sort by Avg_carrier_time_minutes desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-failures-by-carrier[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-failures-by-carrier" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Failures by carrier"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter isFinal
            | filter messageStatus not like /DELIVERED|SUCCESSFUL/
            | stats count(*) as Total by coalesce(carrierName, 'Unknown/VOIP') as Carrier, messageStatus as MessageStatus
            | sort by Total desc
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-get-failures[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-get-failures" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get failures"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | sort @timestamp desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-get-logs[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-get-logs" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Logs"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter isFinal
            | sort @timestamp desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-get-sms-logs-by-dest-phone-number[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-get-sms-logs-by-dest-phone-number" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get SMS logs by destination phone number"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter destinationPhoneNumber like '+1416xxxxxxx'
            | sort Timestamp desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-get-sms-logs-by-orig-phone-number[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-get-sms-logs-by-orig-phone-number" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Get SMS logs by origination phone number"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | filter originationPhoneNumber like '237762'
            | sort Timestamp desc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-international-sending-status[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-international-sending-status" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / International sending status"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message
            | parse @message /"isoCountryCode":"(?<Country>[^"]+)"/
            | parse @message /"eventType":"(?<Event_Type>[^"]+)"/
            | parse @message /"isFinal":(?<Is_Final>\w+)/
            | filter Is_Final = "true"
            | stats count(*) as Event_Count by Country, Event_Type
            | display Country, Event_Type, Event_Count
            | sort Country asc
            | limit 100
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-international-sending-status-sender-id[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-international-sending-status-sender-id" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / International sending status (with Sender IDs)"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message
            | parse @message /"isoCountryCode":"(?<Country>[^"]+)"/
            | parse @message /"eventType":"(?<EventType>[^"]+)"/
            | parse @message /"isFinal":(?<Is_Final>\w+)/
            | filter Is_Final = "true"
            | parse originationPhoneNumber /(?<longCode>\+\d{11})/
            | parse originationPhoneNumber /(?<senderId>^[^\+][a-zA-Z]+)/
            | parse originationPhoneNumber /(?<shortCode>237762)/
            | stats
                count(longCode) as TotalLongCode,
                count(shortCode) as TotalShortCode,
                count(senderId) as TotalSenderId
                by Country, EventType, senderId
            | sort Country asc, EventType asc
        EOT
      + region              = "us-west-2"
    }
  # aws_cloudwatch_query_definition.pinpoint-us-sms-success-vs-unreachable[0] will be created
  + resource "aws_cloudwatch_query_definition" "pinpoint-us-sms-success-vs-unreachable" {
      + id                  = (known after apply)
      + log_group_names     = [
          + (sensitive value),
          + (sensitive value),
        ]
      + name                = "SMS (Pinpoint) / Success vs Unreachable"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp as Timestamp, carrierName as Carrier, messageStatus as `Provider response`, 
            originationPhoneNumber as `Origination phone number`, destinationPhoneNumber as `Destination phone number`, 
            messageId as `Message ID`, messageStatus as `Message Status`, 
            messageStatusDescription as `Message status description`, @message
            | parse messageStatusDescription "Phone is currently unreachable/*" as @unavailable
            | parse messageStatusDescription "Message has been * by phone" as @available
            | stats count(@unavailable) as Unavailable, count(@available) as Available, count(*) as Total by bin(1h)
        EOT
      + region              = "us-west-2"
    }
  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_us_failures[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_us_failures" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pinpoint_to_sqs_sms_callbacks_us_west_2"
      + id                  = (known after apply)
      + principal           = "logs.us-west-2.amazonaws.com"
      + region              = "us-west-2"
      + source_arn          = "arn:aws:logs:us-west-2:296255494825:log-group:sns/us-west-2/296255494825/PinpointDirectPublishToPhoneNumber/Failure:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }
  # aws_lambda_permission.allow_cloudwatch_logs_pinpoint_us_successes[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_logs_pinpoint_us_successes" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pinpoint_to_sqs_sms_callbacks_us_west_2"
      + id                  = (known after apply)
      + principal           = "logs.us-west-2.amazonaws.com"
      + region              = "us-west-2"
      + source_arn          = "arn:aws:logs:us-west-2:296255494825:log-group:sns/us-west-2/296255494825/PinpointDirectPublishToPhoneNumber:*"
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }
  # module.pinpoint_to_sqs_sms_callbacks.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id               = "arn:aws:iam::296255494825:policy/pinpoint_to_sqs_sms_callbacks-0"
        name             = "pinpoint_to_sqs_sms_callbacks-0"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = "arn:aws:sqs:ca-central-1:296255494825:eks-notification-canada-cadelivery-receipts" -> [
                          + "arn:aws:sqs:ca-central-1:296255494825:eks-notification-canada-cadelivery-receipts",
                          + "",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "CostCentre" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }
  # module.pinpoint_to_sqs_sms_callbacks.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pinpoint_to_sqs_sms_callbacks"
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
            "Terraform"  = "true"
        }
        # (30 unchanged attributes hidden)
      + environment {
          + variables = {
              + "SQS_QUEUE_URL" = (sensitive value)
            }
        }
        # (3 unchanged blocks hidden)
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pinpoint_to_sqs_sms_callbacks_us_west_2"
      + name_prefix       = (known after apply)
      + region            = "us-west-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "aws_cloudwatch_log_group.this",
        ]
      + name                = "Lambda Statistics - pinpoint_to_sqs_sms_callbacks_us_west_2"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
      + region              = "us-west-2"
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "pinpoint_to_sqs_sms_callbacks_us_west_2_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CloudWatchAccess"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForlayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-west-2:296255494825:repository/notify/pinpoint_to_sqs_sms_callbacks"
                      + Sid      = "ECRImageAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "pinpoint_to_sqs_sms_callbacks_us_west_2-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:Get*",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:ca-central-1:296255494825:eks-notification-canada-cadelivery-receipts",
                          + "",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pinpoint_to_sqs_sms_callbacks_us_west_2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pinpoint_to_sqs_sms_callbacks_us_west_2"
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "pinpoint_to_sqs_sms_callbacks_us_west_2"
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "pinpoint_to_sqs_sms_callbacks_us_west_2"
    }
  # module.pinpoint_to_sqs_sms_callbacks_us_west_2[0].aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "pinpoint_to_sqs_sms_callbacks_us_west_2"
      + id                             = (known after apply)
      + image_uri                      = "296255494825.dkr.ecr.us-west-2.amazonaws.com/notify/pinpoint_to_sqs_sms_callbacks:bootstrap"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)
      + environment {
          + variables = {
              + "SQS_QUEUE_URL" = (sensitive value)
            }
        }
      + ephemeral_storage {
          + size = 512
        }
      + logging_config (known after apply)
      + tracing_config {
          + mode = "PassThrough"
        }
      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }
Plan: 35 to add, 4 to change, 0 to destroy.

# --- End of Plan 1 ---

```